[
    {
        "id": 1,
        "image_url":"https://iili.io/HSTDcRp.jpg",
        "chef_name":"Massimo Bottura",
        "total_likes": 500,
        "recipes":["Seafood Risotto"," Italian BLT","Torta Caprese(Italian Flourless Chocolate Torte)","Slow Cooker Tuscan Chicken","Manicotti","Pan-Fried Asparagus","Pasta Salad","Shrimp Scampi with Pasta"],
          "experience":[
            "Massimo Bottura is an Italian chef who is widely considered one of the world's best chefs.  Here are some of his notable work experiences:",
            "Early Career: Massimo Bottura began his culinary career by working in several restaurants in Italy and France. He worked at Alain Ducasse's Louis XV in Monte Carlo and Le Jardin des Sens in Montpellier, France.",

          "Trattoria Del Campazzo: In 1994, Bottura opened his first restaurant, Trattoria Del Campazzo, in his hometown of Modena, Italy.",
          
          "Osteria Francescana: In 1995, Bottura opened Osteria Francescana in Modena, Italy. The restaurant has since become one of the world's best restaurants and has been awarded three Michelin stars.",
          
          "International Experience: Bottura has also worked in some of the most prestigious kitchens around the world, including El Bulli in Spain and The Fat Duck in the UK.",
          
          "Food Waste Reduction: In 2015, Bottura launched the Food for Soul project, which aims to reduce food waste and feed the hungry by turning surplus food into meals for those in need.",
          
          "Author : Bottura has also published several cookbooks including Never Trust a Skinny Italian Chef and Bread is Gold. Bottura has won numerous awards throughout his career, including the World's 50 Best Restaurants award multiple times. He was also awarded the Order of Merit of the Italian Republic by the President of Italy in 2016."]
},
    {
        "id": 2,
        "image_url":"https://iili.io/HSTD7Uv.jpg",
        "chef_name":"Fabio Viviani",
        "total_likes": 488,
        "recipes":["Chicken Marsala","Tiramisu","Homemade Sweet Italian Sausage(Mild or Hot)","Easy Italia Chicken","Their Uses","Onions, and Potato Bake","Balsamic Glaze","Pesto Pasta with Chicken"],
          "experience":[
            "Fabio Viviani is an Italian-born chef and restaurateur, known for his appearances on various cooking shows and his successful culinary ventures. Here are some of his notable work experiences:",
          "Early Career: Viviani began his culinary career at the age of 11, working in his family's restaurant in Florence, Italy. He later trained at several Michelin-starred restaurants in Italy.",

          "Top Chef: Viviani gained widespread recognition after appearing on the fifth season of Bravo's Top Chef in 2008. He was a fan favorite and ultimately finished in fourth place.",
          
          "Restaurants: Viviani has since opened several successful restaurants in the United States, including Siena Tavern in Chicago, IL and San Diego, CA, and Osteria in Los Angeles, CA.",
          
          "Cookbook Author: Viviani has authored several cookbooks, including Fabio's Italian Kitchen and Fabio's 30-Minute Italian.",
          
          "TV Appearances: In addition to Top Chef, Viviani has appeared on numerous other cooking shows, including Cutthroat Kitchen, Rachael Ray, and Good Morning America.",
          
          "Business Ventures: Viviani has also launched several business ventures, including a line of cookware and a wine club.",
          
          "Philanthropy: Viviani is actively involved in charitable work and has supported various organizations, including Alex's Lemonade Stand Foundation and the American Red Cross."]
        },
    {
        "id": 3,
        "image_url":"https://freeimage.host/i/giorgio-locate.HScEw8J",
        "chef_name":"Gennaro Contaldo",
        "total_likes": 488,
        "recipes":[
          "Biscotti","Garlic Butter Sauce","Italian Wedding Cookies","Caprese Salad with Balsamic Reduction","White Cheese Chicken Lasagna","Italian Seasoning","Hearty Vegetable Lasagna","Easy Slow Cooker Meatballs"],
          "experience":[
            "Gennaro Contaldo is an Italian chef and restaurateur who is known for his expertise in Italian cuisine. Here are some of his notable work experiences:",
            "Early Career: Contaldo began his culinary career at the age of 8, working in his family's bakery in the Amalfi coast of Italy. Later on, he trained as a chef in the Italian navy.",

          "Restaurateur: Contaldo has opened several successful restaurants in the UK, including Passione in London and the Jamie's Italian chain of restaurants in collaboration with Jamie Oliver.",
          
          "TV Appearances: Contaldo has made many appearances on TV cooking shows, including Two Greedy Italians, Saturday Kitchen, and Sunday Brunch.",
          
          "Cookbook Author: Contaldo has authored several cookbooks, including Gennaro's Italian Year, Gennaro's Passione, and Jamie's Italy.",
          
          "Mentor to Jamie Oliver: Contaldo has been a mentor to Jamie Oliver since the two worked together at Antonio Carluccio's Neal Street Restaurant in London.",
          
          "Culinary Education: Contaldo has also worked as a culinary instructor at various institutions, including the Jamie Oliver's Fifteen Foundation.",
          
          "Awards: Contaldo has received numerous awards throughout his career, including the AA Lifetime Achievement Award in 2017 and the Guinness World Record for the largest bowl of pasta in 2017."]
        },
    {
        "id": 4,
        "image_url": "https://iili.io/HScEVG1.jpg",
        "chef_name":"Giorgio Locatelli",
        "total_likes": 488,
        "recipes":["Oven Roasted Stuffed Chicken Breasts","Italian Breaded Pork Chops","Cioppino","Italian Wedding Soup","Italian Sausage, Peppers, add Onions","Rosemary Braised Lamb Shanks","Easy Homemade Pizza Sauce","Slow Cooker Italian Beef"],
          "experience":[
            "Giorgio Locatelli is an Italian chef and restaurateur who is known for his expertise in Italian cuisine. Here are some of his notable work experiences:",

            "Early Career: Locatelli began his culinary career in Italy, working in several restaurants in Lombardy and Emilia-Romagna.",

          "London Restaurants: In 2002, Locatelli opened his first London restaurant, Locanda Locatelli, which was awarded a Michelin star in 2003. He later opened another restaurant, Locanda Verde, which also received critical acclaim.",
          
          "TV Appearances: Locatelli has made many appearances on TV cooking shows, including Giorgio Locatelli's Italy, Saturday Kitchen, and MasterChef.",
          
          "Cookbook Author: Locatelli has authored several cookbooks, including Made in Italy: Food and Stories and Giorgio Locatelli: Made at Home.",
          
          "Awards: Locatelli has received numerous awards throughout his career, including the AA Chef's Chef of the Year in 2007 and the Caterer and Hotelkeeper's Hotelier of the Year in 2012.",
          
          "Culinary Education: Locatelli is also a culinary educator, and has worked as a visiting professor at the University of West London.",
          
          "Philanthropy: Locatelli is actively involved in charitable work, and has supported several organizations, including the Prince's Trust and Action Against Hunger."]
        },
    {
        "id": 5,
        "image_url": "https://iili.io/HSTDlON.jpg",
        "chef_name":"Carlo Cracco",
        "total_likes": 488,
        "recipes":["Easy Lasagna","Eggplant Parmesan","Pasta Salad With Homemade Dressing","that Zucchini Spaghetti Stanley Tucci Loves","Homemade Four Cheese Ravioli","Panna Cotta","Fried Mozzarella Cheese Sticks","Italian Spaghetti Sauce with Meatballs"],
          "experience":[
          "Carlo Cracco is an Italian chef and restaurateur who is known for his expertise in Italian and contemporary cuisine. Here are some of his notable work experiences:",

          "Early Career: Cracco began his culinary career in Italy, working in several Michelin-starred restaurants, including Gualtiero Marchesi and Enoteca Pinchiorri.",

          "Milan Restaurants: In 2001, Cracco opened his first restaurant, Cracco-Peck, in Milan in collaboration with the historic Peck gourmet food store. He later opened another restaurant, Carlo e Camilla in Segheria, which offers contemporary Italian cuisine.",
          
          "TV Appearances: Cracco has made many appearances on TV cooking shows, including MasterChef Italia,Hell's Kitchen Italia, and Top Chef Italia.",
          
          "Cookbook Author: Cracco has authored several cookbooks, including Il Ristorante Cracco in Galleria and Contemporary Italian Cooking.",
          
          "Awards: Cracco has received numerous awards throughout his career, including three Michelin stars for his Milan restaurant.",
          
          "Culinary Education: Cracco is also a culinary educator, and has taught at several institutions, including the University of Gastronomic Sciences in Pollenzo.",
          
          "Philanthropy: Cracco is actively involved in charitable work, and has supported several organizations, including the Italian Red Cross and the Dynamo Camp, a summer camp for children with serious illnesses."]
        },
    {
        "id": 6,
        "image_url": "https://iili.io/HSTDaJR.jpg",
        "chef_name":"Antonino Cannavacciuolo",
        "total_likes": 488,
        "recipes":["Homemade Lasagna","The Best Meatballs","Meatballs","Pesto Pasta","Chicken Parmesan","Polenta","Homemade Spaghetti Sauce with Ground Beef","Lasagna"],
          "experience":[
          "Antonino Cannavacciuolo is an Italian chef and restaurateur who is known for his expertise in Italian and contemporary cuisine. Here are some of his notable work experiences:",

          "Early Career: Cannavacciuolo began his culinary career in Italy, working in several Michelin-starred restaurants, including Villa Crespi and Le Calandre.",

          "Novara Restaurants: In 2000, Cannavacciuolo opened his first restaurant, Il Ponte in Novara. Later on, he opened Cannavacciuolo Café & Bistrot in Novara, which offers a more informal and affordable dining experience.",
          
          "TV Appearances: Cannavacciuolo has made many appearances on TV cooking shows, including MasterChef Italia,Hell's Kitchen Italia, and Cucine da Incubo.",
          
          "Cookbook Author: Cannavacciuolo has authored several cookbooks, including Prendere Gusto and Natale in Cucina con Antonino Cannavacciuolo.",
          
          "Awards: Cannavacciuolo has received numerous awards throughout his career, including three Michelin stars for his Villa Crespi restaurant.",
          
          "Culinary Education: Cannavacciuolo is also a culinary educator, and has taught at several institutions, including the Gambero Rosso Cooking School.",
          
          "Philanthropy: Cannavacciuolo is actively involved in charitable work, and has supported several organizations, including the Telethon Foundation and the Dynamo Camp, a summer camp for children with serious illnesses."]
        }
]